# Coding Exercises (Part 1)

## Full Data Workflow A-Z: Merging, Joining, Concatenating

### Exercise 12: Merging, joining, aligning and concatenating Data

Now, you will have the opportunity to analyze your own dataset. <br>
__Follow the instructions__ and insert your code! You are either requested to 
- Complete the Code and __Fill in the gaps__. Gaps are marked with "__---__" and are __placeholders__ for your code fragment. 
- Write Code completely __on your own__

In some exercises, you will find questions that can only be answered, if your code is correct and returns the right output! The correct answer is provided below your coding cell. There you can check whether your code is correct.

If you need a hint, check the __Hints Section__ at the end of this Notebook. Exercises and Hints are numerated accordingly.

If you need some further help or if you want to check your code, you can also check the __solutions notebook__.

### Have Fun!

--------------------------------------------------------------------------------------------------------------

## Option 1: Self_guided

### Concatenating DataFrames vertically

__Import__ the cars dataset (with cars from usa and europe) from the csv-file __cars_clean.csv__. <br>
Also __import__ the csv-file __cars_jap.csv__ (with cars from japan) and __concatenate__ both DataFrames __vertically__! <br>
__Save__ the __concatenated DataFrame__ in the variable __cars_all__! <br>
Finally, __sort__ cars_all by the model_year from __low to high__!

### Left Join

__Import__ the csv-files __summer.csv__ (as summer) and __dictionary.csv__ (as dic) which contains the __full country name__ for the olympic country codes as well as __population__ and __gdp__ statistics for some countries.<br>

__"Copy and paste"__ the __full country name__, __population__ and __gdp__ from the dic DataFrame __into the summer DataFrame__ with a __Left Join__!<br>
__Save__ the new merged DataFrame in the variable __summer_new__!<br>

__Inspect__ summer_new and determine the __olympic country codes__ for which the dic DataFrame does __not provide__ any information!

### Arithmetic operations between DataFrames / Alignment

__Import__ the csv-files __ath_2008.csv__ and __ath_2012.csv__ with all medals winners in the Sport __Athletics__ in the Editions __2008__ and __2012__.

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__. (Hint: add should contain an index with the Athlete names and three columns, Gold, Silver, Bronze)

__Sort__ add by Gold, Silver, Bronze from __high to low__! Change datatype to __integer__, if necessary! The first Athlete in your DataFrame should be ... no surprise ... Usain Bolt with 6 Gold and 0 Silver and Bronze Medals.

-------------------------------------

## Option 2: Guided and Instructed

# STOP HERE, IF YOU WANT TO DO THE EXERCISE ON YOUR OWN!

+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

In [1]:
#run the cell
import pandas as pd

### Concatenating DataFrames vertically

In [2]:
#run the cell
cars = pd.read_csv("../../Data/cars_clean.csv")

__Inspect__ the __cars__ DataFrame!

In [4]:
#run the cell
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,Chevrolet Chevelle Malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,Buick Skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,Plymouth Satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,Amc Rebel Sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,Ford Torino

In [5]:
#run the cell
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
308,27.0,4,140.0,86.0,2790,15.6,82,usa,Ford Mustang Gl
309,44.0,4,97.0,52.0,2130,24.6,82,europe,Vw Pickup
310,32.0,4,135.0,84.0,2295,11.6,82,usa,Dodge Rampage
311,28.0,4,120.0,79.0,2625,18.6,82,usa,Ford Ranger
312,31.0,4,119.0,82.0,2720,19.4,82,usa,Chevrolet S-10

In [6]:
#run the cell
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 313 entries, 0 to 312
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           313 non-null    float64
 1   cylinders     313 non-null    int64
 2   displacement  313 non-null    float64
 3   horsepower    313 non-null    float64
 4   weight        313 non-null    int64
 5   acceleration  313 non-null    float64
 6   model_year    313 non-null    int64
 7   origin        313 non-null    object
 8   name          313 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 22.1+ KB

__Inspect__ the cars_jap DataFrame!

In [13]:
#run the cell
cars_jap = pd.read_csv("cars_jap.csv")

In [14]:
#run the cell
cars_jap.head()

    mpg  cyl   disp    hp  weight   acc  year                   name
0  24.0    4  113.0  95.0    2372  15.0    70  toyota corona mark ii
1  27.0    4   97.0  88.0    2130  14.5    70           datsun pl510
2  27.0    4   97.0  88.0    2130  14.5    71           datsun pl510
3  25.0    4  113.0  95.0    2228  14.0    71          toyota corona
4  31.0    4   71.0  65.0    1773  19.0    71    toyota corolla 1200

Before we can concatenate both DataFrames, we need to __align__ them!<br>
108. __Insert__ the column __origin__ to __cars_jap__ at the most appropriate position! __Fill in the gaps!__

In [15]:
cars_jap.insert(column='origin', value='Japan', loc=7)

Also the column labels should match. <br>
109. __Overwrite__ the column labels in __cars_jap__ and use the same column labels that we have in cars!

In [17]:
cars_jap.columns = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'model_year', 'origin', 'name']

__Inspect__!

In [18]:
#run the cell
cars_jap.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,24.0,4,113.0,95.0,2372,15.0,70,Japan,toyota corona mark ii
1,27.0,4,97.0,88.0,2130,14.5,70,Japan,datsun pl510
2,27.0,4,97.0,88.0,2130,14.5,71,Japan,datsun pl510
3,25.0,4,113.0,95.0,2228,14.0,71,Japan,toyota corona
4,31.0,4,71.0,65.0,1773,19.0,71,Japan,toyota corolla 1200

110. __Concatenate__ both DataFrames __vertically__ and create a __new RangeIndex__! __Save__ the new DataFrame in the variable __cars_all__!

In [29]:
cars_all = pd.concat([cars, cars_jap], ignore_index=True)

__Inspect__!

In [30]:
#run the cell
cars_all.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,Chevrolet Chevelle Malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,Buick Skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,Plymouth Satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,Amc Rebel Sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,Ford Torino

In [31]:
#run the cell!
cars_all.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
387,34.0,4,108.0,70.0,2245,16.9,82,Japan,toyota corolla
388,38.0,4,91.0,67.0,1965,15.0,82,Japan,honda civic
389,32.0,4,91.0,67.0,1965,15.7,82,Japan,honda civic (auto)
390,38.0,4,91.0,67.0,1995,16.2,82,Japan,datsun 310 gx
391,32.0,4,144.0,96.0,2665,13.9,82,Japan,toyota celica gt

111. __Sort cars_call__ by the __model_year__ from __low to high__! Create a __new RangeIndex__ (drop the old)! __Fill in the gaps__!

In [39]:
cars_all = cars_all.sort_values('model_year', ascending=True).reset_index(drop=True)

__Inspect__!

In [40]:
#run the cell
cars_all.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,Chevrolet Chevelle Malibu
1,27.0,4,97.0,88.0,2130,14.5,70,Japan,datsun pl510
2,9.0,8,304.0,193.0,4732,18.5,70,usa,Ih 1200D
3,11.0,8,318.0,210.0,4382,13.5,70,usa,Dodge D200
4,10.0,8,307.0,200.0,4376,15.0,70,usa,Chevrolet C20

In [41]:
#run the cell
cars_all.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
387,44.0,4,97.0,52.0,2130,24.6,82,europe,Vw Pickup
388,32.0,4,135.0,84.0,2295,11.6,82,usa,Dodge Rampage
389,28.0,4,120.0,79.0,2625,18.6,82,usa,Ford Ranger
390,38.0,4,91.0,67.0,1995,16.2,82,Japan,datsun 310 gx
391,32.0,4,144.0,96.0,2665,13.9,82,Japan,toyota celica gt

In [42]:
#run the cell
cars_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 27.7+ KB

----------------------------------------------------------------------

### Left Join

In [44]:
# run the cell!
summer = pd.read_csv("summer.csv")

__Inspect__ the __summer__ DataFrame!

In [46]:
# run the cell!
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [47]:
# run the cell!
dic = pd.read_csv("dictionary.csv")

__Inspect__ dict!

In [48]:
# run the cell!
dic.head()

           Country Code  Population  GDP per Capita
0      Afghanistan  AFG  32526562.0      594.323081
1          Albania  ALB   2889167.0     3945.217582
2          Algeria  ALG  39666519.0     4206.031232
3  American Samoa*  ASA     55538.0             NaN
4          Andorra  AND     70473.0             NaN

__dic__ contains the Olympic Games __Country Codes__ ("Code") with the corresponding __full country names__ ("Country") as well as recent __Population__ and __GDP__ statistics.<br>

112. __Create__ the columns __Country__, __Population__ and __GDP per Capita__ in the __summer__ DataFrame by using a __Left Join__ with __pd.merge()__. <br>
__Save__ the merged Dataframe in the variable __summer_new__! __Fill in the gaps__!

In [53]:
summer_new = pd.merge(
    summer, dic, how='left', right_on='Code', left_on='Country' 
)

__Inspect__ summer_new!

In [54]:
# run the cell!
summer_new.head()

,Year,City,Sport,Discipline,Athlete,Country_x,Gender,Event,Medal,Country_y,Code,Population,GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary,HUN,9844686.0,12363.543460
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Austria,AUT,8611088.0,43774.985174
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Greece,GRE,10823732.0,18002.230578
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Greece,GRE,10823732.0,18002.230578
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Greece,GRE,10823732.0,18002.230578

In [55]:
# run the cell!
summer_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            31165 non-null  int64
 1   City            31165 non-null  object
 2   Sport           31165 non-null  object
 3   Discipline      31165 non-null  object
 4   Athlete         31165 non-null  object
 5   Country_x       31161 non-null  object
 6   Gender          31165 non-null  object
 7   Event           31165 non-null  object
 8   Medal           31165 non-null  object
 9   Country_y       25742 non-null  object
 10  Code            25742 non-null  object
 11  Population      25696 non-null  float64
 12  GDP per Capita  25142 non-null  float64
dtypes: float64(2), int64(1), object(10)
memory usage: 3.1+ MB

Apparently, __dic__ does __not contain__ additional information for __all olympic country codes__ that are in the __summer__ Dataframe.

113. __Filter__ summer_new for the elements in the column __Country_x__, where the __corresponding value__ in the column __Code__ is __missing__! <br>
__Count__ the frequency! __Fill in the gaps__!

In [58]:
summer_new.loc[summer_new.Code.isnull(), "Country_x"].value_counts()

Country_x
URS    2049
GDR     825
ROU     640
FRG     490
YUG     435
TCH     329
EUA     260
EUN     223
ZZX      48
SRB      31
ANZ      29
RU1      17
MNE      14
TTO      10
BOH       7
BWI       5
SGP       4
IOP       3
Name: count, dtype: int64

For these country codes, we need to find __other sources__ for additional information on the __full country name__, __population__ and __gdp__ (most of these countries do not exist any more.) -> BONUS EXERCISE ;-)

--------------------------

### Arithmetic operations between DataFrames / Alignment

In [95]:
#run the cell
ath_2008 = pd.read_csv("ath_2008.csv")
ath_2012 = pd.read_csv("ath_2012.csv")

__Inspect__ the __ath_2008__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2008__.

In [96]:
#run the cell
ath_2008.head()

              Athlete  Gold  Silver  Bronze
0    ABAKUMOVA, Maria     0       1       0
1  ABEYLEGESSE, Elvan     0       2       0
2  ALEKNA, Virgilijus     0       0       1
3      ALEXEEV, Denis     0       0       1
4     ANTONOVA, Olena     0       0       1

In [97]:
#run the cell
ath_2008.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Athlete  159 non-null    object
 1   Gold     159 non-null    int64
 2   Silver   159 non-null    int64
 3   Bronze   159 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.1+ KB

__Inspect__ the __ath_2012__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2012__.

In [98]:
#run the cell
ath_2012.head()

              Athlete  Gold  Silver  Bronze
0      ADAMS, Valerie     1       0       0
1  ALLEYNE-FORTE, Ade     0       0       1
2         AMOS, Nijel     0       1       0
3    ANTYUKH, Natalya     1       1       0
4       ASSEFA, Sofia     0       1       0

In [99]:
#run the cell
ath_2012.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Athlete  171 non-null    object
 1   Gold     171 non-null    int64
 2   Silver   171 non-null    int64
 3   Bronze   171 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.5+ KB

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__!

114. First, __set__ the __Athlete__ column as the __index__ in both DataFrames! __Save__ the changes!

In [100]:
ath_2008.set_index('Athlete', inplace=True)

In [101]:
ath_2012.set_index('Athlete', inplace=True)

115. __Add__ both DataFrames with the __most appropriate method__! __Save__ the resulting DataFrame in the variable __add__!

In [107]:
add = ath_2008.add(ath_2012,fill_value=0)

__Inspect__!

In [108]:
#run the cell
add.head(10)

                    Gold  Silver  Bronze
Athlete
ABAKUMOVA, Maria     0.0     1.0     0.0
ABEYLEGESSE, Elvan   0.0     2.0     0.0
ADAMS, Valerie       1.0     0.0     0.0
ALEKNA, Virgilijus   0.0     0.0     1.0
ALEXEEV, Denis       0.0     0.0     1.0
ALLEYNE-FORTE, Ade   0.0     0.0     1.0
AMOS, Nijel          0.0     1.0     0.0
ANTONOVA, Olena      0.0     0.0     1.0
ANTYUKH, Natalya     1.0     1.0     0.0
ASAHARA, Nobuharu    0.0     0.0     1.0

116. __Sort__ the athletes by the number of __Gold__, __Silver__ and __Bronze__ medals from __high to low__!<br>
__Fill in the gaps!__ Who is the top athlete?

In [109]:
add = add.sort_values(["Gold", "Silver", "Bronze"], ascending = False)

In [110]:
# run the cell!
add.head()

                  Gold  Silver  Bronze
Athlete
BOLT, Usain        6.0     0.0     0.0
FELIX, Allyson     4.0     1.0     0.0
DIBABA, Tirunesh   3.0     0.0     1.0
TAYLOR, Angelo     2.0     1.0     0.0
BEKELE, Kenenisa   2.0     0.0     0.0

In [111]:
# run the cell!
add.tail()

                         Gold  Silver  Bronze
Athlete
WILLIAMS, Novelene        0.0     0.0     1.0
WILLIAMS-MILLS, Novlene   0.0     0.0     1.0
YEGO, Alfred Kirwa        0.0     0.0     1.0
YURCHENKO, Denys          0.0     0.0     1.0
ZHOU, Chunxiu             0.0     0.0     1.0

No surprise, its Usain Bolt!

# Well Done!

------------------------------------------------

# Hints (Spoiler!)

108. insert() method, index pos. 7

109. columns attribute

110. pd.concat() method, ignore index

111. methods sort_values() and reset_index()

112. left DataFrame: summer, on "Country" and "Code"

113. methods isnull() and value_counts()

114. set_index() method

115. add() method, fill_value = 0

116. pass a list of columns to sort_values() method (sequence matters!)